<?php
include ('../dbconfig.php');
$sql="SELECT * FROM `history_leave` WHERE `id`='".$_GET['id']."' AND `level_lea`='".$_GET['level_lea']."'";
$result=mysqli_query($db_connection,$sql);
$sum=0;
while($row=mysqli_fetch_assoc($result)){
	$sum=$sum+$row['time_leave'];
}
$sum2=$sum-$_GET['time_leave'];
require('../fpdf/fpdf.php');
$pdf = new FPDF();
		$pdf->SetMargins( 25,25,20 );
		$pdf->AddPage("P","A3");
		$pdf->AddFont('THSarabunNew','B','THSarabunNew Bold.php');
		$pdf->SetFont('THSarabunNew','B',18);
		$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'ใบลาพักผ่อน' ),0,1,'C');
        $pdf->AddFont('THSarabunNew','','THSarabunNew.php');
		$pdf->SetFont('THSarabunNew','',16);
		$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'เขียนที่ องค์การบริหารส่วนตำบลพรายวาส' ),0,1,'R');
		$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'วันที่..........เดือน...............................พ.ศ..................' ),0,1,'R');
		$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'เรื่อง................................................................' ),0,1,'L');
		$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , "เรียน   นายกองค์การบริหารส่วนตำบลพลายวาส" ),0,1,'L');
		$pdf->MultiCell(0,8,iconv( 'UTF-8','TIS-620' , "                        ข้าพเจ้า...........................................................................ตำแหน่ง...........................................................
สังกัด...................................................................................................องค์การบริหารส่วนตำบลพลายวาส มีวันเวลา
พักผ่อนสะสม.......................วันทำการ มีสิทธิลาพักผ่อนประจำ มีสิทธิลาพักผ่อนประจำปีนี้อีก 10 วันทำการ รวมเป็น..........................วัน
ทำการขอลาพักผ่อนตั้งแต่วันที่..........................................................................ถึงวันที่.......................................................................
มีกำหนด............................................วัน  ในระหว่างลาจะติดต่อข้าพเจ้าได้ที่................................................................................." ));
        $pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');
		$pdf->Cell(75,8, iconv( 'UTF-8','TIS-620' , 'สถิติการลาในปีงบประมาณนี้' ),1,1,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , 'ลามาแล้ว' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , 'ลาครั้งนี้' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , 'รวมเป็น' ),1,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , 'ขอแสดงความนับถือ' ),0,1,'C');
        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '(วันทำการ)' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '(วันทำการ)' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '(วันทำการ)' ),1,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '(ลงชื่อ).......................................................................' ),0,1,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , "{$sum2}" ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , "{$_GET['time_leave']}"  ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , "{$sum}" ),1,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '(.......................................................................)' ),0,1,'C');
        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');
        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),1,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');
        
        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , 'ความเห็นของผู้บังคับบัญชา' ),0,1,'C');

        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');

        $pdf->Cell(85,8, iconv( 'UTF-8','TIS-620' , '(ลงชื่อ)......................................................ผู้ตรวจสอบ' ),0,0,'C');
		$pdf->Cell(70,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '(ลงชื่อ).......................................................................' ),0,1,'C');

        $pdf->Cell(85,8, iconv( 'UTF-8','TIS-620' , '(.......................................................................)' ),0,0,'C');
        $pdf->Cell(70,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '(.......................................................................)' ),0,1,'C');

        $pdf->Cell(85,8, iconv( 'UTF-8','TIS-620' , 'ตำแหน่ง ................................................' ),0,0,'C');
        $pdf->Cell(70,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , 'ตำแหน่ง ปลัดองค์การบริหารส่วนตำบล' ),0,1,'C');
        
        $pdf->Cell(85,8, iconv( 'UTF-8','TIS-620' , 'วันที่............เดือน.....................................พ.ศ............' ),0,0,'C');
        $pdf->Cell(70,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , 'วันที่............เดือน.....................................พ.ศ............' ),0,1,'C');

$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');

        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
 L		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->AddFont('THSarabunNew','B','THSarabunNew Bold.php');
		$pdf->SetFont('THSarabunNew','B',16);
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , 'คำสั่ง' ),0,0,'C');
        $pdf->Cell(80,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->Cell(97,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');

        $pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
		$pdf->Cell(25,8, iconv( 'UTF-8','TIS-620' , '' ),0,0,'C');
        $pdf->SetFont('ZapfDingbats','',16);
        $pdf->Cell(10,8,chr(111),0,0,'');
        $pdf->AddFont('THSarabunNew','','THSarabunNew.php');
		$pdf->SetFont('THSarabunNew','',16);
        $pdf->Cell(50,8, iconv( 'UTF-8','TIS-620' , 'อนุญาติ' ),0,0,'L');
        $pdf->SetFont('ZapfDingbats','',16);
        $pdf->Cell(10,8,chr(111),0,0,'');
        $pdf->AddFont('THSarabunNew','','THSarabunNew.php');
		$pdf->SetFont('THSarabunNew','',16);
        $pdf->Cell(107,8, iconv( 'UTF-8','TIS-620' , 'ไม่อนุญาต  เพราะ...............................................' ),0,1,'L');

$pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , '' ),0,1,'C');

        $pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , '(ลงชื่อ).......................................................................' ),0,1,'C');
         $pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , '(.......................................................................)' ),0,1,'C');
         $pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'ตำแหน่ง นายกองค์การบริหารส่วนตำบลพลายวาส' ),0,1,'C');
        $pdf->Cell(0,8, iconv( 'UTF-8','TIS-620' , 'วันที่............เดือน.....................................พ.ศ..............' ),0,1,'C');
        
		$pdf->Output();
?>